# ETL Processes
Use this notebook to develop the ETL process for each of your tables before completing the `etl.py` file to load the whole datasets.

In [1]:
!python create_tables.py

In [2]:
import os
import glob
import psycopg2
import pandas as pd
from sql_queries import *

In [3]:
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
conn.set_session(autocommit=True)
cur = conn.cursor()

In [4]:
def get_files(filepath):
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,'*.json'))
        for f in files :
            all_files.append(os.path.abspath(f))
    
    return all_files

# os.walk()：通过自上而下或自下而上遍历目录树来生成目录树中的文件名

# Process `song_data`
In this first part, you'll perform ETL on the first dataset, `song_data`, to create the `songs` and `artists` dimensional tables.

Let's perform ETL on a single song file and load a single record into each table to start.
- Use the `get_files` function provided above to get a list of all song JSON files in `data/song_data`
- Select the first song in this list
- Read the song file and view the data

In [5]:
song_files = "./data/song_data/"

filepaths = get_files(song_files)

songs = pd.read_json(filepaths[0], lines=True)
songs.head()

,artist_id,artist_latitude,artist_location,artist_longitude,artist_name,duration,num_songs,song_id,title,year
0,AR7G5I41187FB4CE6C,NaN,"London, England",NaN,Adam Ant,233.40363,1,SONHOTT12A8C13493C,Something Girls,1982

## #1: `songs` Table
#### Extract Data for Songs Table
- Select columns for song ID, title, artist ID, year, and duration
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `song_data`

In [11]:
song_data = songs[["song_id", "title", "artist_id", "year", "duration"]].values.tolist()[0]

song_data

['SONHOTT12A8C13493C',
 'Something Girls',
 'AR7G5I41187FB4CE6C',
 1982,
 233.40363]

#### Insert Record into Song Table
Implement the `song_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song into the `songs` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songs` table in the sparkify database.

In [12]:
print(song_table_insert)
print(song_data)
cur.execute(song_table_insert, song_data)
conn.commit()

INSERT INTO songs (song_id , title , artist_id , year , duration ) Values (%s, %s, %s, %s, %s)
ON CONFLICT(song_id)
DO NOTHING

['SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363]

Run `test.ipynb` to see if you've successfully added a record to this table.

## #2: `artists` Table
#### Extract Data for Artists Table
- Select columns for artist ID, name, location, latitude, and longitude
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `artist_data`

In [13]:
artist_data = songs[['artist_id', 'artist_name', 'artist_location', 'artist_latitude', 'artist_longitude']].values[0].tolist()
artist_data

['AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan]

#### Insert Record into Artist Table
Implement the `artist_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song's artist into the `artists` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `artists` table in the sparkify database.

In [14]:
print(artist_table_insert)
print(artist_data)

cur.execute(artist_table_insert, artist_data)
conn.commit()

INSERT INTO artists (artist_id, name, location, lattitude, longitude) Values (%s, %s, %s, %s, %s)
ON CONFLICT(artist_id)
DO NOTHING

['AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan]

Run `test.ipynb` to see if you've successfully added a record to this table.

# Process `log_data`
In this part, you'll perform ETL on the second dataset, `log_data`, to create the `time` and `users` dimensional tables, as well as the `songplays` fact table.

Let's perform ETL on a single log file and load a single record into each table.
- Use the `get_files` function provided above to get a list of all log JSON files in `data/log_data`
- Select the first log file in this list
- Read the log file and view the data

In [15]:
log_files = "./data/log_data"

filepath = get_files(log_files)
filepath

['/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-11-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-23-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-18-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-04-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-01-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-14-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-08-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-26-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-25-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-17-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-02-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-30-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-07-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-29-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-20-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-12-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-09-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-27-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-15-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-05-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-19-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-22-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-10-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-13-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-21-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-06-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-28-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-03-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-16-events.json',
 '/Users/zhou/Desktop/Udacity_study/数据工程师项目文件/Postgre项目/home/data/log_data/2018/11/2018-11-24-events.json']

In [16]:
df = pd.read_json(filepath[0], lines=True)
df.head()

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Frumpies,Logged In,Anabelle,F,0,Simpson,134.47791,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,Fuck Kitty,200,1541903636796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
1,Kenny G with Peabo Bryson,Logged In,Anabelle,F,1,Simpson,264.75057,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,By The Time This Night Is Over,200,1541903770796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
2,Biffy Clyro,Logged In,Anabelle,F,2,Simpson,189.83138,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,God & Satan,200,1541904034796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
3,None,Logged In,Lily,F,0,Burns,NaN,free,"New York-Newark-Jersey City, NY-NJ-PA",GET,Home,1.540621e+12,456,None,200,1541910841796,"""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK...",32
4,HIM,Logged In,Lily,F,1,Burns,212.06159,free,"New York-Newark-Jersey City, NY-NJ-PA",PUT,NextSong,1.540621e+12,456,Beautiful,200,1541910973796,"""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK...",32

## #3: `time` Table
#### Extract Data for Time Table
- Filter records by `NextSong` action
- Convert the `ts` timestamp column to datetime
  - Hint: the current timestamp is in milliseconds
- Extract the timestamp, hour, day, week of year, month, year, and weekday from the `ts` column and set `time_data` to a list containing these values in order
  - Hint: use pandas' [`dt` attribute](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html) to access easily datetimelike properties.
- Specify labels for these columns and set to `column_labels`
- Create a dataframe, `time_df,` containing the time data for this file by combining `column_labels` and `time_data` into a dictionary and converting this into a dataframe

In [17]:
df = df[df.page=='NextSong']
df['ts'] = pd.to_datetime(df['ts'], unit='ms')
df.head(1)

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Frumpies,Logged In,Anabelle,F,0,Simpson,134.47791,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,Fuck Kitty,200,2018-11-11 02:33:56.796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69

In [18]:
t = df[['ts']].copy()
t.head()

                       ts
0 2018-11-11 02:33:56.796
1 2018-11-11 02:36:10.796
2 2018-11-11 02:40:34.796
4 2018-11-11 04:36:13.796
5 2018-11-11 04:36:46.796

In [19]:
t['timestamp'] = t.ts
t['hour'] = t.ts.dt.hour
t['day'] = t.ts.dt.day
t['weekofyear'] = t.ts.dt.weekofyear
t['month'] = t.ts.dt.month
t['year'] = t.ts.dt.year
t['weekday'] = t.ts.dt.weekday
t.head()

,ts,timestamp,hour,day,weekofyear,month,year,weekday
0,2018-11-11 02:33:56.796,2018-11-11 02:33:56.796,2,11,45,11,2018,6
1,2018-11-11 02:36:10.796,2018-11-11 02:36:10.796,2,11,45,11,2018,6
2,2018-11-11 02:40:34.796,2018-11-11 02:40:34.796,2,11,45,11,2018,6
4,2018-11-11 04:36:13.796,2018-11-11 04:36:13.796,4,11,45,11,2018,6
5,2018-11-11 04:36:46.796,2018-11-11 04:36:46.796,4,11,45,11,2018,6

In [20]:

time_data = t
column_labels = ()

In [21]:
time_df = t.drop(columns=['ts'])

time_df.head()

                timestamp  hour  day  weekofyear  month  year  weekday
0 2018-11-11 02:33:56.796     2   11          45     11  2018        6
1 2018-11-11 02:36:10.796     2   11          45     11  2018        6
2 2018-11-11 02:40:34.796     2   11          45     11  2018        6
4 2018-11-11 04:36:13.796     4   11          45     11  2018        6
5 2018-11-11 04:36:46.796     4   11          45     11  2018        6

#### Insert Records into Time Table
Implement the `time_table_insert` query in `sql_queries.py` and run the cell below to insert records for the timestamps in this log file into the `time` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `time` table in the sparkify database.

In [22]:
for i, row in time_df.iterrows():
    cur.execute(time_table_insert, list(row))
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

## #4: `users` Table
#### Extract Data for Users Table
- Select columns for user ID, first name, last name, gender and level and set to `user_df`

In [24]:
print(df.columns)
user_df = df[['userId', 'firstName', 'lastName', 'gender', 'level']]
user_df.head()

Index(['artist', 'auth', 'firstName', 'gender', 'itemInSession', 'lastName',
       'length', 'level', 'location', 'method', 'page', 'registration',
       'sessionId', 'song', 'status', 'ts', 'userAgent', 'userId'],
      dtype='object')

  userId firstName   lastName gender level
0     69  Anabelle    Simpson      F  free
1     69  Anabelle    Simpson      F  free
2     69  Anabelle    Simpson      F  free
4     32      Lily      Burns      F  free
5     75    Joseph  Gutierrez      M  free

#### Insert Records into Users Table
Implement the `user_table_insert` query in `sql_queries.py` and run the cell below to insert records for the users in this log file into the `users` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `users` table in the sparkify database.

In [25]:
for i, row in user_df.iterrows():
    cur.execute(user_table_insert, row)
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

## #5: `songplays` Table
#### Extract Data and Songplays Table
This one is a little more complicated since information from the songs table, artists table, and original log file are all needed for the `songplays` table. Since the log file does not specify an ID for either the song or the artist, you'll need to get the song ID and artist ID by querying the songs and artists tables to find matches based on song title, artist name, and song duration time.
- Implement the `song_select` query in `sql_queries.py` to find the song ID and artist ID based on the title, artist name, and duration of a song.
- Select the timestamp, user ID, level, song ID, artist ID, session ID, location, and user agent and set to `songplay_data`

#### Insert Records into Songplays Table
- Implement the `songplay_table_insert` query and run the cell below to insert records for the songplay actions in this log file into the `songplays` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songplays` table in the sparkify database.

In [23]:
print(df.columns)
print(df.length.dtype)
df.head(1)

Index(['artist', 'auth', 'firstName', 'gender', 'itemInSession', 'lastName',
       'length', 'level', 'location', 'method', 'page', 'registration',
       'sessionId', 'song', 'status', 'ts', 'userAgent', 'userId'],
      dtype='object')
float64

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Muse,Logged In,Harper,M,1,Barrett,209.50159,paid,"New York-Newark-Jersey City, NY-NJ-PA",PUT,NextSong,1.540685e+12,275,Supermassive Black Hole (Twilight Soundtrack V...,200,2018-11-09 00:06:17.796,"""Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebK...",42

In [24]:
"songplay_id, start_time, user_id, level, song_id, artist_id, session_id, location, user_agent"
for index, row in df.iterrows():

    # get songid and artistid from song and artist tables
    cur.execute(song_select, (row.song, row.artist, float(row.length)))
    results = cur.fetchone()
    
    if not results:
        continue
    songid, artistid = results

        
        
    # insert songplay record
   
    songplay_data = (row.ts, row.userId, row.level, songid, artistid, row.sessionId, row.location, row.userAgent )
    cur.execute(songplay_table_insert, songplay_data)
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

# Close Connection to Sparkify Database

In [14]:
conn.close()

# Implement `etl.py`
Use what you've completed in this notebook to implement `etl.py`.

In [5]:
!python etl.py

71 files found in data/song_data
1/71 files processed.
2/71 files processed.
3/71 files processed.
4/71 files processed.
5/71 files processed.
6/71 files processed.
7/71 files processed.
8/71 files processed.
9/71 files processed.
10/71 files processed.
11/71 files processed.
12/71 files processed.
13/71 files processed.
14/71 files processed.
15/71 files processed.
16/71 files processed.
17/71 files processed.
18/71 files processed.
19/71 files processed.
20/71 files processed.
21/71 files processed.
22/71 files processed.
23/71 files processed.
24/71 files processed.
25/71 files processed.
26/71 files processed.
27/71 files processed.
28/71 files processed.
29/71 files processed.
30/71 files processed.
31/71 files processed.
32/71 files processed.
33/71 files processed.
34/71 files processed.
35/71 files processed.
36/71 files processed.
37/71 files processed.
38/71 files processed.
39/71 files processed.
40/71 files processed.
41/71 files processed.
42/71 files processed.
43/71 files processed.
44/71 files processed.
45/71 files processed.
46/71 files processed.
47/71 files processed.
48/71 files processed.
49/71 files processed.
50/71 files processed.
51/71 files processed.
52/71 files processed.
53/71 files processed.
54/71 files processed.
55/71 files processed.
56/71 files processed.
57/71 files processed.
58/71 files processed.
59/71 files processed.
60/71 files processed.
61/71 files processed.
62/71 files processed.
63/71 files processed.
64/71 files processed.
65/71 files processed.
66/71 files processed.
67/71 files processed.
68/71 files processed.
69/71 files processed.
70/71 files processed.
71/71 files processed.
30 files found in data/log_data
1/30 files processed.
2/30 files processed.
3/30 files processed.
4/30 files processed.
5/30 files processed.
6/30 files processed.
7/30 files processed.
8/30 files processed.
9/30 files processed.
10/30 files processed.
11/30 files processed.
12/30 files processed.
13/30 files processed.
14/30 files processed.
15/30 files processed.
16/30 files processed.
17/30 files processed.
18/30 files processed.
19/30 files processed.
20/30 files processed.
21/30 files processed.
22/30 files processed.
23/30 files processed.
24/30 files processed.
25/30 files processed.
26/30 files processed.
27/30 files processed.
28/30 files processed.
29/30 files processed.
30/30 files processed.